In [1]:
#Importing packages
import pandas as pd
from sqlalchemy import create_engine

print("Libraries imported!")

Libraries imported!

In [2]:
#Create sql engine
engine = create_engine("sqlite:///mta.db")

#Load db using real_sql
df = pd.read_sql('SELECT * FROM mta_data;', engine)

#Display first 5 rows
df.head()

,CA,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS
0,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS ...
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,03:00:00,REGULAR,7543925,2573549
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,07:00:00,REGULAR,7543931,2573559
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,11:00:00,REGULAR,7543970,2573622
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,15:00:00,REGULAR,7544072,2573700

In [3]:
#We see the first row in the all_data df is the headers, so let's drop it and reset index
df = df.drop(0, axis = 0).reset_index(drop=True)
df.head()

,CA,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,03:00:00,REGULAR,7543925,2573549
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,07:00:00,REGULAR,7543931,2573559
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,11:00:00,REGULAR,7543970,2573622
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,15:00:00,REGULAR,7544072,2573700
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,19:00:00,REGULAR,7544219,2573729

In [4]:
df.shape

(3353761, 11)

- This dataset has 3353761 rows and 11 columns. <br />
- Now let's check out the data types of each rows and the columns of the dataset

In [5]:
df.dtypes

CA          object
UNIT        object
SCP         object
STATION     object
LINENAME    object
DIVISION    object
DATE        object
TIME        object
DESC        object
ENTRIES     object
EXITS       object
dtype: object

In [6]:
df.columns

Index(['CA', 'UNIT', 'SCP', 'STATION', 'LINENAME', 'DIVISION', 'DATE', 'TIME',
       'DESC', 'ENTRIES', 'EXITS'],
      dtype='object')

- Looks like all columns have the dame data types of object, which is **NOT** good for `DATE` and `TIME` field, also the `ENTRIES` and `EXITS` should be `integer` instead of `object`. 
- So, let's create a new column named `DATE_TIME` of the **datetime** datatype combining two columns `DATE` and `TIME` using [pd.to_datetime](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_datetime.html) and convert `ENTRIES` and `EXITS` to datatype `int` using [pd.DataFrame.astype](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.astype.html).

In [7]:
#Create another column called DATE_TIME
df['DATE_TIME'] = pd.to_datetime(df.DATE + " " + df.TIME,
                                      format="%m/%d/%Y %H:%M:%S")
df.head()

,CA,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATE_TIME
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,03:00:00,REGULAR,7543925,2573549,2021-03-13 03:00:00
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,07:00:00,REGULAR,7543931,2573559,2021-03-13 07:00:00
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,11:00:00,REGULAR,7543970,2573622,2021-03-13 11:00:00
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,15:00:00,REGULAR,7544072,2573700,2021-03-13 15:00:00
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,19:00:00,REGULAR,7544219,2573729,2021-03-13 19:00:00

In [8]:
#Let's convert columns ENTRIES and EXITS to type int
df['ENTRIES'] = df['ENTRIES'].astype('int64')
df['EXITS'] = df['EXITS'].astype('int64')
df.head()

,CA,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATE_TIME
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,03:00:00,REGULAR,7543925,2573549,2021-03-13 03:00:00
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,07:00:00,REGULAR,7543931,2573559,2021-03-13 07:00:00
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,11:00:00,REGULAR,7543970,2573622,2021-03-13 11:00:00
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,15:00:00,REGULAR,7544072,2573700,2021-03-13 15:00:00
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,19:00:00,REGULAR,7544219,2573729,2021-03-13 19:00:00

- Now we look at some basic information of the dataframe.

In [9]:
df.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3353761 entries, 0 to 3353760
Data columns (total 12 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   CA         3353761 non-null  object
 1   UNIT       3353761 non-null  object
 2   SCP        3353761 non-null  object
 3   STATION    3353761 non-null  object
 4   LINENAME   3353761 non-null  object
 5   DIVISION   3353761 non-null  object
 6   DATE       3353761 non-null  object
 7   TIME       3353761 non-null  object
 8   DESC       3353761 non-null  object
 9   ENTRIES    3353761 non-null  int64
 10  EXITS      3353761 non-null  int64
 11  DATE_TIME  3353761 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(9)
memory usage: 307.0+ MB

In [10]:
df.describe()

            ENTRIES         EXITS
count  3.353761e+06  3.353761e+06
mean   4.220130e+07  3.402362e+07
std    2.184740e+08  1.948730e+08
min    0.000000e+00  0.000000e+00
25%    2.292640e+05  9.470800e+04
50%    1.554851e+06  9.192150e+05
75%    6.199834e+06  4.077691e+06
max    2.128726e+09  2.123103e+09

### Closer look at the dataset:
> According to the mta's website, each combination of `C/A`, `UNIT`, `SCP`, and `STATION` represents a unique turnstile. Let's mask the dataframe based on uniquely identified turnstile and see what it shows at one specific day.

In [11]:
mask = ((df['CA'] == 'TRAM2') 
& (df['UNIT'] == 'R469') 
& (df['SCP'] == '00-03-01') 
& (df['STATION'] == 'RIT-ROOSEVELT')
& (df['DATE'] == '03/13/2021'))
df[mask]

,CA,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATE_TIME
206928,TRAM2,R469,00-03-01,RIT-ROOSEVELT,R,RIT,03/13/2021,00:00:00,REGULAR,3133536,397450,2021-03-13 00:00:00
206929,TRAM2,R469,00-03-01,RIT-ROOSEVELT,R,RIT,03/13/2021,04:00:00,REGULAR,3133536,397450,2021-03-13 04:00:00
206930,TRAM2,R469,00-03-01,RIT-ROOSEVELT,R,RIT,03/13/2021,08:00:00,REGULAR,3133536,397450,2021-03-13 08:00:00
206931,TRAM2,R469,00-03-01,RIT-ROOSEVELT,R,RIT,03/13/2021,12:00:00,REGULAR,3133536,397450,2021-03-13 12:00:00
206932,TRAM2,R469,00-03-01,RIT-ROOSEVELT,R,RIT,03/13/2021,16:00:00,REGULAR,3133536,397450,2021-03-13 16:00:00
206933,TRAM2,R469,00-03-01,RIT-ROOSEVELT,R,RIT,03/13/2021,20:00:00,REGULAR,3133536,397450,2021-03-13 20:00:00

- Looks like for each day, the system logs in the records for each turnstile every 4 hours (which is why we have 6 rows for one day per turnstile).
- Since we are trying to find the best location for the best potential customer volume, we are only interested in the `bussiness hours` time frame of the dataset; specifically, it's best to focus on `between 8AM and 10PM` everyday.
- So, let's take advantage of `pandas` to convert `TIME` column into `int` datatype and **filter** the dataset `between 8AM and 10PM`. I will use [pd.astype](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.astype.html).

In [12]:
df_temp = df
df_temp['TIME'] = df_temp.TIME.str.replace(':','')
df_temp['TIME'] = df_temp.TIME.astype('int64')
df_temp.head()

,CA,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATE_TIME
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,30000,REGULAR,7543925,2573549,2021-03-13 03:00:00
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,70000,REGULAR,7543931,2573559,2021-03-13 07:00:00
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,110000,REGULAR,7543970,2573622,2021-03-13 11:00:00
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,150000,REGULAR,7544072,2573700,2021-03-13 15:00:00
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,190000,REGULAR,7544219,2573729,2021-03-13 19:00:00

In [18]:
#Let's single out the data between 8AM and 10PM just for our bussiness' purpose.
df_temp = df_temp[(df_temp.TIME >= 80000) & (df_temp.TIME <= 200000)].reset_index(drop=True)
print(df_temp.shape)
df_temp.info(show_counts=True)

(1882603, 12)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1882603 entries, 0 to 1882602
Data columns (total 12 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   CA         1882603 non-null  object
 1   UNIT       1882603 non-null  object
 2   SCP        1882603 non-null  object
 3   STATION    1882603 non-null  object
 4   LINENAME   1882603 non-null  object
 5   DIVISION   1882603 non-null  object
 6   DATE       1882603 non-null  object
 7   TIME       1882603 non-null  int64
 8   DESC       1882603 non-null  object
 9   ENTRIES    1882603 non-null  int64
 10  EXITS      1882603 non-null  int64
 11  DATE_TIME  1882603 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(3), object(8)
memory usage: 172.4+ MB

In [19]:
df_temp.head(10)

,CA,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATE_TIME
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,110000,REGULAR,7543970,2573622,2021-03-13 11:00:00
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,150000,REGULAR,7544072,2573700,2021-03-13 15:00:00
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,190000,REGULAR,7544219,2573729,2021-03-13 19:00:00
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/14/2021,80000,REGULAR,7544326,2573747,2021-03-14 08:00:00
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/14/2021,120000,REGULAR,7544359,2573776,2021-03-14 12:00:00
5,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/14/2021,160000,REGULAR,7544436,2573815,2021-03-14 16:00:00
6,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/14/2021,200000,REGULAR,7544559,2573830,2021-03-14 20:00:00
7,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/15/2021,80000,REGULAR,7544603,2573895,2021-03-15 08:00:00
8,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/15/2021,120000,REGULAR,7544656,2574003,2021-03-15 12:00:00
9,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/15/2021,160000,REGULAR,7544819,2574040,2021-03-15 16:00:00

**Comments on the preliminary analysis :**
- The `ENTRIES` column represents **cumulative entries** registered to the device at specific time.
- The `EXITS` column represents **cumulative exits** registered to the device at specific time.
- We got the dataset contains only data between `8AM` to `10PM`.
> Now we would like to focus more on the `ENTRIES` each device gains each day from `8AM-10PM`
- The logic to calculate the total entries for each day is:
    * Sort the `ENTRIES` columns in descending order for each day.
    * Calculate the `ENTRIES` difference between the current day and the previous day.
    * Add all the different `ENTRIES` up on each day.

In [29]:
df_temp[['PREV_DATE', 'PREV_ENTRIES']] = (df_temp.groupby(["CA", "UNIT", "STATION"])["DATE", "ENTRIES"]
                                          .apply(lambda x: x.shift(1)))
df_temp.head()

<ipython-input-29-5f8beb0698c0>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df_temp[['PREV_DATE', 'PREV_ENTRIES']] = (df_temp.groupby(["CA", "UNIT", "STATION"])["DATE", "ENTRIES"]

,CA,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATE_TIME,PREV_DATE,PREV_ENTRIES
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,110000,REGULAR,7543970,2573622,2021-03-13 11:00:00,NaN,NaN
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,150000,REGULAR,7544072,2573700,2021-03-13 15:00:00,03/13/2021,7543970.0
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/13/2021,190000,REGULAR,7544219,2573729,2021-03-13 19:00:00,03/13/2021,7544072.0
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/14/2021,80000,REGULAR,7544326,2573747,2021-03-14 08:00:00,03/13/2021,7544219.0
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/14/2021,120000,REGULAR,7544359,2573776,2021-03-14 12:00:00,03/14/2021,7544326.0

There are some `NaN` on the data. Let's check out how many there are and why it appears on the data.

In [33]:
df_temp.isna().sum()

CA                0
UNIT              0
SCP               0
STATION           0
LINENAME          0
DIVISION          0
DATE              0
TIME              0
DESC              0
ENTRIES           0
EXITS             0
DATE_TIME         0
PREV_DATE       750
PREV_ENTRIES    750
dtype: int64

Looks like we have some rows that have `NaN` as the values. The reason is because when we `shift` the row, for each turnstile, the first day of the record does not have the previous day to shift, so the default result would be `NaN`. Now let's drop those `NaN` values from our table.

In [34]:
# Drop the rows for the earliest date in the df
df_temp.dropna(subset=["PREV_DATE"], axis=0, inplace=True)
print("The new shape of the dataframe is {}".format(df_temp.shape))

The new shape of the dataframe is (1881853, 14)

In [24]:
df_daily = (df_temp.groupby(["CA", "UNIT", "SCP", "STATION", "DATE"], as_index=False).ENTRIES.first())
df_daily.shape

(557616, 6)

In [15]:
df_temp.DESC.value_counts()

REGULAR       1882603
RECOVR AUD       6845
Name: DESC, dtype: int64

In [16]:
#df_temp = df_temp[~df_temp.DESC.str.contains('RECOVR AUD')]